# Python statistics essential training - 02_05_challenge

# Standard imports

In [1]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

# Functions

In [2]:
def mapAges(x):
    """map the age columns from the xx or xxx or xxxx format to x-x, x-xx, or xx-xx format"""
    
    keys=list(x.unique())
    age_dict={}
#     print (keys)
    
    for i,s in enumerate(keys):
        
        l=len(s)
        ss=l==2 and s=='65'
    #     print(ss)

        if ss==True:
            age_range='65'
            age_dict[s]=age_range
            continue
        if (l==2):
            age_range=f'{s[0]}-{s[1:]}'
        elif (l==3):
            age_range=f'{s[0]}-{s[1:]}'
        elif (l==4):
            age_range=f'{s[0:2]}-{s[2:]}'
    
#         print(age_range)
        age_dict[s]=age_range
        
    return age_dict

# Get Data

In [3]:
tb=pd.read_csv('tb.csv')
tb.head()

,country,year,m04,m514,m014,m1524,m2534,m3544,m4554,m5564,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5769 entries, 0 to 5768
Data columns (total 22 columns):
country    5746 non-null object
year       5769 non-null int64
m04        392 non-null float64
m514       401 non-null float64
m014       2381 non-null float64
m1524      2407 non-null float64
m2534      2408 non-null float64
m3544      2415 non-null float64
m4554      2421 non-null float64
m5564      2414 non-null float64
m65        2408 non-null float64
mu         273 non-null float64
f04        393 non-null float64
f514       404 non-null float64
f014       2378 non-null float64
f1524      2394 non-null float64
f2534      2400 non-null float64
f3544      2398 non-null float64
f4554      2401 non-null float64
f5564      2394 non-null float64
f65        2396 non-null float64
fu         272 non-null float64
dtypes: float64(20), int64(1), object(1)
memory usage: 991.6+ KB

In [5]:
tb.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

## Replace NaN with 0.0

In [ ]:
tb.replace(np.nan,0.0,inplace=True)
tb.head()

In [6]:
tb.dropna(axis=0,inplace=True)
tb.head()

,country,year,m04,m514,m014,m1524,m2534,m3544,m4554,m5564,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
15,AD,2005,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0
16,AD,2006,0.0,0.0,0.0,1.0,1.0,2.0,0.0,1.0,...,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0
18,AD,2008,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0,0.0,0.0
44,AE,2008,0.0,0.0,0.0,6.0,1.0,7.0,5.0,3.0,...,0.0,0.0,0.0,10.0,4.0,1.0,1.0,3.0,3.0,0.0
141,AL,2005,0.0,0.0,0.0,26.0,21.0,16.0,31.0,20.0,...,0.0,0.0,0.0,3.0,9.0,5.0,5.0,5.0,18.0,0.0

In [7]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 241 entries, 15 to 5712
Data columns (total 22 columns):
country    241 non-null object
year       241 non-null int64
m04        241 non-null float64
m514       241 non-null float64
m014       241 non-null float64
m1524      241 non-null float64
m2534      241 non-null float64
m3544      241 non-null float64
m4554      241 non-null float64
m5564      241 non-null float64
m65        241 non-null float64
mu         241 non-null float64
f04        241 non-null float64
f514       241 non-null float64
f014       241 non-null float64
f1524      241 non-null float64
f2534      241 non-null float64
f3544      241 non-null float64
f4554      241 non-null float64
f5564      241 non-null float64
f65        241 non-null float64
fu         241 non-null float64
dtypes: float64(20), int64(1), object(1)
memory usage: 43.3+ KB

In [8]:
tb.fu

15      0.0
16      0.0
18      0.0
44      0.0
141     0.0
142     0.0
143     0.0
170     0.0
171     0.0
172     0.0
173     0.0
244     8.0
299     0.0
300     0.0
357     0.0
358     0.0
386     0.0
387     2.0
388     0.0
389     0.0
416     0.0
471     0.0
472     0.0
474     0.0
528     0.0
531     0.0
559     0.0
669     0.0
726     0.0
754     0.0
       ...
4644    0.0
4670    0.0
4671    0.0
4672    0.0
4673    0.0
4699    0.0
4700    0.0
4701    0.0
4702    0.0
4775    0.0
4879    0.0
4929    0.0
5062    0.0
5065    0.0
5124    0.0
5126    0.0
5185    0.0
5209    0.0
5210    0.0
5211    0.0
5212    0.0
5241    0.0
5269    0.0
5326    0.0
5354    0.0
5383    0.0
5412    0.0
5439    0.0
5498    0.0
5712    0.0
Name: fu, Length: 241, dtype: float64

## Melt Columns

In [9]:
tb=tb.melt(id_vars=['country','year'],value_vars=['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564',
       'm65', 'f04', 'f514', 'f014', 'f1524', 'f2534', 'f3544', 'f4554',
       'f5564', 'f65'],
                  var_name='sex',value_name='observations')

In [10]:
tb.head()

  country  year  sex  observations
0      AD  2005  m04           0.0
1      AD  2006  m04           0.0
2      AD  2008  m04           0.0
3      AE  2008  m04           0.0
4      AL  2005  m04           0.0

In [11]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4338 entries, 0 to 4337
Data columns (total 4 columns):
country         4338 non-null object
year            4338 non-null int64
sex             4338 non-null object
observations    4338 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 135.6+ KB

In [12]:
tb['age']=tb['sex'].str.slice(1)

In [13]:
tb.head()

  country  year  sex  observations age
0      AD  2005  m04           0.0  04
1      AD  2006  m04           0.0  04
2      AD  2008  m04           0.0  04
3      AE  2008  m04           0.0  04
4      AL  2005  m04           0.0  04

In [14]:
tb['age']=tb['age'].map(mapAges(tb.age))

In [15]:
tb.head()

  country  year  sex  observations  age
0      AD  2005  m04           0.0  0-4
1      AD  2006  m04           0.0  0-4
2      AD  2008  m04           0.0  0-4
3      AE  2008  m04           0.0  0-4
4      AL  2005  m04           0.0  0-4

In [16]:
tb['sex']=tb['sex'].apply(lambda s: s[0])

In [17]:
tb.head()

  country  year sex  observations  age
0      AD  2005   m           0.0  0-4
1      AD  2006   m           0.0  0-4
2      AD  2008   m           0.0  0-4
3      AE  2008   m           0.0  0-4
4      AL  2005   m           0.0  0-4

In [18]:
tb=tb[['country','year','age','sex','observations']]
tb.head()

  country  year  age sex  observations
0      AD  2005  0-4   m           0.0
1      AD  2006  0-4   m           0.0
2      AD  2008  0-4   m           0.0
3      AE  2008  0-4   m           0.0
4      AL  2005  0-4   m           0.0

In [19]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4338 entries, 0 to 4337
Data columns (total 5 columns):
country         4338 non-null object
year            4338 non-null int64
age             4338 non-null object
sex             4338 non-null object
observations    4338 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 169.5+ KB

In [20]:
tb.sort_values(['country','year','age','sex'],inplace=True)

In [21]:
tb.head(20)

     country  year    age sex  observations
2651      AD  2005   0-14   f           0.0
482       AD  2005   0-14   m           0.0
2169      AD  2005    0-4   f           0.0
0         AD  2005    0-4   m           0.0
2892      AD  2005  15-24   f           1.0
723       AD  2005  15-24   m           0.0
3133      AD  2005  25-34   f           1.0
964       AD  2005  25-34   m           1.0
3374      AD  2005  35-44   f           1.0
1205      AD  2005  35-44   m           1.0
3615      AD  2005  45-54   f           0.0
1446      AD  2005  45-54   m           0.0
2410      AD  2005   5-14   f           0.0
241       AD  2005   5-14   m           0.0
3856      AD  2005  55-64   f           0.0
1687      AD  2005  55-64   m           0.0
4097      AD  2005     65   f           0.0
1928      AD  2005     65   m           0.0
2652      AD  2006   0-14   f           0.0
483       AD  2006   0-14   m           0.0

In [22]:
tb.to_csv('tb_final.csv',index=False)

# Extras